{
  "_class_name": "UNet3DConditionModel",
  "_diffusers_version": "0.9.0",
  "act_fn": "silu",
  "attention_head_dim": 8,
  "block_out_channels": [
    320,
    640,
    1280,
    1280
  ],
  "center_input_sample": false,
  "cross_attention_dim": 768,
  "down_block_types": [
    "CrossAttnDownBlock3D",
    "CrossAttnDownBlock3D",
    "CrossAttnDownBlock3D",
    "DownBlock3D"
  ],
  "downsample_padding": 1,
  "dual_cross_attention": false,
  "flip_sin_to_cos": true,
  "freq_shift": 0,
  "in_channels": 4,
  "layers_per_block": 2,
  "mid_block_scale_factor": 1,
  "norm_eps": 1e-05,
  "norm_num_groups": 32,
  "num_class_embeds": null,
  "only_cross_attention": false,
  "out_channels": 4,
  "sample_size": 64,
  "up_block_types": [
    "UpBlock3D",
    "CrossAttnUpBlock3D",
    "CrossAttnUpBlock3D",
    "CrossAttnUpBlock3D"
  ],
  "use_linear_projection": false,
  "use_inflated_groupnorm": true,
  "unet_use_cross_frame_attention": false,
  "unet_use_temporal_attention": false,
  "use_motion_module": true,
  "motion_module_resolutions": [1, 2, 4, 8],
  "motion_module_mid_block": true,
  "motion_module_decoder_only": false,
  "motion_module_type": "Vanilla",
  "motion_module_kwargs": {
      "num_attention_heads": 8,
      "num_transformer_block": 1,
      "attention_block_types": ["Temporal_Self", "Temporal_Self"],
      "temporal_position_encoding": true,
      "temporal_position_encoding_max_len": 32,
      "temporal_attention_dim_div": 1
  },
  "attention_mode": "SpatialAtten",
  "mid_block_type": "UNetMidBlock3DCrossAttn"
}
